from tensor_intro_to_python.most_expensive import most_expensive


def test_answer_1():
    assert most_expensive([{'наименование': 'спички', 'цена': '1'},
                           {'наименование': 'лук', 'цена': '37'},
                           {'наименование': 'чеснок', 'цена': '30'},
                           {'наименование': 'огурцы', 'цена': '42'},
                           {'наименование': 'помидоры', 'цена': '56'},
                           {'наименование': 'капуста', 'цена': '55'}]) == \
           [{'наименование': 'помидоры', 'цена': '56'},
            {'наименование': 'капуста', 'цена': '55'}]
