"""
дан список словарей, найдите топ-2 самых дорогих товаров
и вывести в том же формате
[{'наименование': 'спички', 'цена': '1'},
{'наименование': 'лук', 'цена': '37'},
{'наименование': 'чеснок', 'цена': '30'},
{'наименование': 'огурцы', 'цена': '42'},
{'наименование': 'помидоры', 'цена': '56'},
{'наименование': 'капуста', 'цена': '55'}]
"""


def most_expensive(products):
    sorted_by_price = sorted(products,
                             key=lambda x: int(x.get('цена')), reverse=True)
    return sorted_by_price[:2]
